;; p142
;; 5-1

;;; 四捨五入
(round 2.2)								; => 2
(round 2.9)								; => 3
(round -2.2)							; => -2
(round -2.9)							; => -3

;;; 10で四捨五入
(* 10 (round 22 10))					; => 20
(round 22 10)							; => 2
(round 52 10)							; => 5
(round 58 10)							; => 6
(* 10 (round 29 10))					; => 30

;;; 切り上げ
(ceiling 2.2)							; => 3
(ceiling 2.9)							; => 3
(ceiling -2.2)							; => -2
(ceiling -2.9)							; => -2

;;; 切り下げ
(floor 2.2)								; => 2
(floor 2.9)								; => 2
(floor -2.2)							; => -3
(floor -2.9)							; => -3

;;; 切り捨て
(truncate 2.2)								; => 2
(truncate 2.9)								; => 2
(truncate -2.2)							; => -2
(truncate -2.9)							; => -2

(random)								; => -1297811871184096270
(random)								; => 653278066906928737
(random)								; => 609744398493584640
(random)								; => -1511148089491570573
(random)								; => 826092649838006599

(random 10)								; => 7
(random 10)								; => 0
(random 10)								; => 0
(random 10)								; => 5
